# ============================================================================
# TAPS - PACKAGE REPOSITORIES
# ============================================================================
tap "1password/tap"                  # 1Password official homebrew tap
tap "facebook/fb"                    # Facebook/Meta official homebrew tap
tap "homebrew/bundle"                # Homebrew bundle for Brewfile support
tap "homebrew/cask-versions"         # Alternative versions of Casks
tap "homebrew/services"              # Manage homebrew services
tap "nodenv/nodenv"                  # Nodenv tap for node version management
tap "qovery/replibyte"               # Replibyte database replication tool

# ============================================================================
# DEVELOPMENT TOOLS - LANGUAGES & RUNTIMES
# ============================================================================
brew "node"                          # Platform for building network applications
brew "nvm"                           # Manage multiple Node.js versions
brew "nodenv"                        # Node version management
brew "node-build"                    # Install NodeJS versions
brew "python@3.11"                   # Python programming language (version 3.11)
brew "python@3.12"                   # Python programming language (version 3.12)
brew "pyenv"                         # Python version management
brew "openjdk"                       # Java Development Kit
brew "ruby@3.1"                      # Powerful, clean, object-oriented scripting language
brew "rbenv"                         # Ruby version manager
brew "uv"                            # Python package manager

# ============================================================================
# DEVELOPMENT TOOLS - VERSION CONTROL
# ============================================================================
brew "git"                           # Distributed version control system
brew "git-lfs"                       # Git extension for versioning large files
brew "git-filter-repo"               # Tool for rewriting git repository history
brew "gh"                            # GitHub CLI
brew "diff-so-fancy"                  # Diff tool for git

# ============================================================================
# DEVELOPMENT TOOLS - MOBILE DEVELOPMENT
# ============================================================================
brew "cocoapods"                     # Dependency manager for Swift and Objective-C
brew "ios-deploy"                    # Install and debug iOS apps without Xcode
brew "fastlane"                      # Tool for iOS and Android app automation
brew "facebook/fb/idb-companion"     # iOS debug bridge companion
brew "watchman"                      # Watch files and take action when they change

# ============================================================================
# DEVELOPMENT TOOLS - BUILD & AUTOMATION
# ============================================================================
brew "act"                           # Run GitHub Actions locally
brew "ansible"                       # IT automation platform
brew "gradle"                        # Build automation tool for Java
brew "chezmoi"                       # Dotfiles manager
brew "mkcert"                        # Simple tool to make locally trusted development certificates

# ============================================================================
# DEVELOPMENT TOOLS - DATABASES
# ============================================================================
brew "postgresql@14"                 # Object-relational database system
brew "qovery/replibyte/replibyte"    # Database replication tool

# ============================================================================
# CLOUD & INFRASTRUCTURE TOOLS
# ============================================================================
brew "awscli"                        # Official Amazon AWS command-line interface
brew "doctl"                         # DigitalOcean CLI
brew "dnsmasq"                       # Lightweight DNS forwarder and DHCP server
brew "homeassistant-cli"             # Command-line tool for Home Assistant

# ============================================================================
# COMMAND LINE UTILITIES
# ============================================================================
brew "fzf"                           # Command-line fuzzy finder
brew "jq"                            # Lightweight and flexible command-line JSON processor
brew "ripgrep"                       # Search tool like grep, but faster
brew "wget"                          # Internet file retriever
brew "pup"                           # Command-line HTML parsing tool
brew "zsh-autosuggestions"           # Fish-like autosuggestions for zsh
brew "powerlevel10k"                 # Theme for Zsh

# ============================================================================
# NETWORK TOOLS
# ============================================================================
brew "iperf"                         # Tool to measure maximum TCP and UDP bandwidth
brew "iperf3"                        # Tool to measure maximum TCP and UDP bandwidth (version 3)
brew "mvfst"                         # Implementation of the QUIC transport protocol
brew "nss"                           # Libraries for security-enabled client and server applications

# ============================================================================
# MEDIA & GRAPHICS LIBRARIES
# ============================================================================
brew "ffmpeg"                        # Play, record, convert, and stream audio and video
brew "imagemagick"                   # Tools and libraries to manipulate images
brew "ghostscript"                   # Interpreter for PostScript and PDF
brew "tesseract"                     # OCR (Optical Character Recognition) engine

# ============================================================================
# MEDIA DEPENDENCIES & LIBRARIES
# ============================================================================
brew "giflib"                        # Library for processing GIFs
brew "libpng"                        # PNG image format library
brew "zstd"                          # Fast real-time compression algorithm
brew "little-cms2"                   # Color management engine
brew "jpeg-xl"                       # JPEG XL image format
brew "aom"                           # AV1 video codec
brew "jpeg", link: true              # Image manipulation library
brew "libheif"                       # HEIF file format decoder and encoder
brew "liblqr"                        # C/C++ seam carving library
brew "libraw"                        # Library for reading RAW files from digital cameras
brew "librsvg"                       # Library to render SVG files
brew "shared-mime-info"              # Database of common MIME types
brew "harfbuzz"                      # Text shaping engine
brew "openjpeg"                      # JPEG 2000 image library
brew "pango"                         # Framework for layout and rendering of i18n text
brew "cairo"                         # Vector graphics library

# ============================================================================
# FACEBOOK/META SPECIFIC LIBRARIES
# ============================================================================
brew "boost"                         # Collection of portable C++ source libraries
brew "glib"                          # Core application library for C
brew "libevent"                      # Asynchronous event library
brew "folly"                         # Collection of reusable C++ library artifacts developed at Facebook
brew "fizz"                          # TLS 1.3 implementation by Facebook
brew "wangle"                        # C++ networking library by Facebook
brew "fbthrift"                      # Facebook's branch of Apache Thrift
brew "fb303"                         # Base service framework from Facebook
brew "edencommon"                    # Shared library for Facebook source control systems

# ============================================================================
# PYTHON DEPENDENCIES
# ============================================================================
brew "pycparser"                     # C parser in Python (dependency for other Python packages)
brew "cffi"                          # Foreign Function Interface for Python calling C code
brew "cryptography"                  # Cryptographic recipes and primitives for Python
brew "docutils"                      # Text processing system for reStructuredText
brew "pipx"                          # Execute binaries from Python packages in isolated environments

# ============================================================================
# MISCELLANEOUS TOOLS
# ============================================================================
brew "dfu-util"                      # Device firmware update USB programmer
brew "geckodriver"                   # WebDriver for Firefox
brew "llvm"                          # Next-gen compiler infrastructure
brew "openssl@1.1"                   # Cryptography and SSL/TLS Toolkit
brew "pkgconf"                       # Package compiler and linker metadata toolkit
brew "serialosc", restart_service: :changed  # Opensound control server for monome devices

# ============================================================================
# APPLICATIONS (CASKS)
# ============================================================================
cask "1password"                     # Password manager
cask "1password-cli"                 # Command-line interface for 1Password
cask "alt-tab"                       # Windows alt-tab style window switcher
cask "expo-orbit"                    # Expo development environment
cask "firefox"                       # Web browser
cask "postman"                       # API development environment
cask "react-native-debugger"         # Standalone debugger for React Native
cask "robo-3t"                       # MongoDB management tool
cask "zulu@11"                       # OpenJDK distribution from Azul (Java 11)
cask "zulu@17"                       # OpenJDK distribution from Azul (Java 17)

# ============================================================================
# FONTS
# ============================================================================
cask "font-cascadia-code"            # Monospaced font by Microsoft
cask "font-fira-code"                # Monospaced font with programming ligatures
cask "font-jetbrains-mono"           # Monospaced font by JetBrains
cask "font-meslo-lg-nerd-font"       # Patched font for Powerline and dev icons

# ============================================================================
# VS CODE EXTENSIONS
# ============================================================================
# Themes and UI
vscode "akamud.vscode-theme-onedark"          # One Dark theme
vscode "dracula-theme.theme-dracula"          # Dracula theme
vscode "github.github-vscode-theme"           # GitHub theme
vscode "liviuschera.noctis"                   # Noctis theme collection
vscode "pkief.material-icon-theme"            # Material icon theme
vscode "whizkydee.material-palenight-theme"   # Material Palenight theme

# Language Support
vscode "golang.go"                            # Go language support
vscode "ms-python.python"                     # Python language support
vscode "ms-python.vscode-pylance"             # Python language server
vscode "prisma.prisma"                        # Prisma ORM support
vscode "rust-lang.rust-analyzer"              # Rust language support
vscode "tamasfe.even-better-toml"             # TOML support
vscode "redhat.vscode-xml"                    # XML support
vscode "redhat.vscode-yaml"                   # YAML support
vscode "william-voyek.vscode-nginx"           # NGINX configuration
vscode "idleberg.applescript"                 # AppleScript support

# JavaScript/TypeScript
vscode "dbaeumer.vscode-eslint"               # ESLint integration
vscode "esbenp.prettier-vscode"               # Code formatter
vscode "jpoissonnier.vscode-styled-components" # Styled Components syntax highlighting
vscode "orta.vscode-jest"                     # Jest test integration
vscode "unifiedjs.vscode-mdx"                 # MDX support
vscode "xyc.vscode-mdx-preview"               # MDX preview
vscode "mattpocock.ts-error-translator"       # TypeScript error explanations
vscode "yoavbls.pretty-ts-errors"             # Prettier TypeScript errors
vscode "stringham.move-ts"                    # TypeScript file mover
vscode "wix.glean"                            # React component refactoring
vscode "planbcoding.vscode-react-refactor"    # React refactoring tools

# Mobile Development
vscode "msjsdiag.vscode-react-native"         # React Native tools
vscode "swmansion.react-native-ide"           # React Native IDE
vscode "expo.vscode-expo-tools"               # Expo tools integration

# GraphQL
vscode "apollographql.vscode-apollo"          # Apollo GraphQL integration
vscode "graphql.vscode-graphql"               # GraphQL language support
vscode "graphql.vscode-graphql-syntax"        # GraphQL syntax highlighting
vscode "mquandalle.graphql"                   # GraphQL support

# Python Tools
vscode "ms-python.autopep8"                   # Python formatter
vscode "ms-python.black-formatter"            # Black Python formatter
vscode "ms-python.debugpy"                    # Python debugger
vscode "ms-python.isort"                      # Python import sorter
vscode "ms-python.pylint"                     # Python linter
vscode "donjayamanne.python-environment-manager" # Python environment manager
vscode "njpwerner.autodocstring"              # Python docstring generator

# Git and GitHub
vscode "eamodio.gitlens"                      # Git supercharged
vscode "github.vscode-github-actions"         # GitHub Actions
vscode "github.vscode-pull-request-github"    # GitHub pull request integration
vscode "gitlab.gitlab-workflow"               # GitLab workflow integration
vscode "mhutchie.git-graph"                   # Git graph visualization
vscode "waderyan.gitblame"                    # Git blame annotations

# AI and Copilot
vscode "github.copilot"                       # GitHub Copilot AI assistant
vscode "github.copilot-chat"                  # GitHub Copilot chat
vscode "github.copilot-labs"                  # GitHub Copilot labs features
vscode "visualstudioexptteam.intellicode-api-usage-examples" # API usage examples
vscode "visualstudioexptteam.vscodeintellicode" # AI-assisted development
vscode "bito.bito"                            # Bito AI coding assistant
vscode "genieai.chatgpt-vscode"               # ChatGPT integration
vscode "danielsanmedium.dscodegpt"            # CodeGPT integration
vscode "saoudrizwan.claude-dev"               # Claude AI integration
vscode "supermaven.supermaven"                # SuperMaven AI assistant

# Web Development
vscode "austenc.tailwind-docs"                # Tailwind CSS documentation
vscode "bradlc.vscode-tailwindcss"            # Tailwind CSS IntelliSense
vscode "stylelint.vscode-stylelint"           # CSS/SCSS/Less linter
vscode "cssho.vscode-svgviewer"               # SVG viewer
vscode "techer.open-in-browser"               # Open files in browser
vscode "tobermory.es6-string-html"            # ES6 string HTML highlighting

# Productivity and Utilities
vscode "aaron-bond.better-comments"           # Improve code comments with color coding
vscode "chakrounanas.turbo-console-log"       # Console log generator
vscode "christian-kohler.npm-intellisense"    # NPM dependency autocompletion
vscode "christian-kohler.path-intellisense"   # Filename autocompletion
vscode "chrmarti.regex"                       # Regular expression previewer
vscode "editorconfig.editorconfig"            # EditorConfig support
vscode "formulahendry.auto-rename-tag"        # Auto rename paired HTML/XML tags
vscode "naumovs.color-highlight"              # Highlight color codes
vscode "oouo-diogo-perdigao.docthis"          # JSDoc comment generator
vscode "streetsidesoftware.code-spell-checker" # Spell checker
vscode "wayou.vscode-todo-highlight"          # TODO highlight

# Remote Development
vscode "github.codespaces"                    # GitHub Codespaces
vscode "ms-vscode-remote.remote-containers"   # Remote container development
vscode "ms-vsliveshare.vsliveshare"           # Live collaboration
vscode "ms-vsliveshare.vsliveshare-pack"      # Live collaboration pack

# Testing and Debugging
vscode "ms-playwright.playwright"             # Playwright test framework
vscode "ms-vscode.js-debug-nightly"           # JavaScript debugger
vscode "rangav.vscode-thunder-client"         # API client

# Database
vscode "mongodb.mongodb-vscode"               # MongoDB integration

# Design
vscode "figma.figma-vscode-extension"         # Figma integration
vscode "idered.figma"                         # Figma integration
vscode "statelyai.stately-vscode"             # State machine visualization

# Miscellaneous
vscode "nicollasr.vscode-streamdeck"          # Stream Deck integration
vscode "ms-vscode.vscode-speech"              # Speech recognition
vscode "threadheap.serverless-ide-vscode"     # Serverless framework support
vscode "vintharas.learn-vim"                  # Learn Vim
vscode "vscodevim.vim"                        # Vim emulation

# ============================================================================
# MAC APP STORE APPS
# ============================================================================
mas "1Password for Safari", id: 1569813296
mas "Apple Configurator", id: 1037126344
mas "DaftCloud", id: 1320450034
mas "Developer", id: 640199958
mas "Disk Speed Test", id: 425264550
mas "Home Assistant", id: 1099568401
mas "Keka", id: 470158793
mas "Kindle", id: 302584613
mas "Messenger", id: 1480068668
mas "Microsoft Outlook", id: 985367838
mas "Pages", id: 409201541
mas "Perplexity", id: 6714467650
mas "SiteSucker", id: 442168834
mas "Switch Sound File Converter", id: 1087079310
mas "Tailscale", id: 1475387142
mas "TestFlight", id: 899247664
mas "TextSniper", id: 1528890965
mas "Transmit", id: 1436522307
mas "Trello", id: 1278508951
mas "Vimari", id: 1480933944
mas "Virtual Teleprompter Pro", id: 1591588588
mas "WhatsApp", id: 310633997
mas "Xcode", id: 497799835
mas "xScope", id: 889428659
