jorgebucaran/fisher
patrickf1/fzf.fish
jethrokuan/z
ilancosman/tide@v6
franciscolourenco/done
jorgebucaran/autopair.fish
nickeb96/puffer-fish
lewisacidic/fish-git-abbr
halostatue/fish-chezmoi@v1
gazorby/fish-abbreviation-tips
plttn/fish-eza
